In [1]:
import pandas as pd
from sqlalchemy import text
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('Adidas US Sales Datasets.csv')
del df['Retailer ID']
df.head()

,Retailer,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
0,Foot Locker,1/1/20,Northeast,New York,New York,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,Foot Locker,1/2/20,Northeast,New York,New York,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,Foot Locker,1/3/20,Northeast,New York,New York,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,Foot Locker,1/4/20,Northeast,New York,New York,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,Foot Locker,1/5/20,Northeast,New York,New York,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

In [3]:
df = df.rename(columns={'Retailer ID':'retailer_ID',
                        'Region':'region',
                        'State':'state',
                        'City':'city',
                        'Product':'segment',
                        'Retailer':'retailer',
                        'Invoice Date':'invoice_date',
                        'Price per Unit':'unit_price',
                        'Units Sold':'units_sold',
                        'Total Sales':'total_sales',
                        'Operating Profit':'operating_profit',
                        'Operating Margin':'operating_margin',
                        'Sales Method':'sales_method'})
df.head()

,retailer,invoice_date,region,state,city,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,sales_method
0,Foot Locker,1/1/20,Northeast,New York,New York,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,Foot Locker,1/2/20,Northeast,New York,New York,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,Foot Locker,1/3/20,Northeast,New York,New York,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,Foot Locker,1/4/20,Northeast,New York,New York,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,Foot Locker,1/5/20,Northeast,New York,New York,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

### Check for the data information

In [4]:
# check for null values
df.info()

# we could find that there are not null values in the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9648 entries, 0 to 9647
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9648 non-null   object
 1   invoice_date      9648 non-null   object
 2   region            9648 non-null   object
 3   state             9648 non-null   object
 4   city              9648 non-null   object
 5   segment           9648 non-null   object
 6   unit_price        9648 non-null   object
 7   units_sold        9648 non-null   object
 8   total_sales       9648 non-null   object
 9   operating_profit  9648 non-null   object
 10  operating_margin  9648 non-null   object
 11  sales_method      9648 non-null   object
dtypes: object(12)
memory usage: 904.6+ KB

### Create database in PostgreSQL

In [5]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/Adidas'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [6]:
import psycopg2
  
conn = psycopg2.connect(
    database="Adidas",
    user='postgres',
    password='123',
    host='localhost',
    port= '5432'
)
  
conn.autocommit = True
# create a cursor
cur = conn.cursor()

In [7]:
# Pass the SQL statements that create all tables
createCmd = """
   CREATE TABLE location (
        location_id INTEGER PRIMARY KEY,
        region VARCHAR(50),
        state VARCHAR(50),
        city VARCHAR(50)
);

    CREATE TABLE retailer (
        retailer_id INTEGER PRIMARY KEY,
        retailer VARCHAR(50),
        location_id INTEGER REFERENCES location(location_id)
);

   CREATE TABLE product_segment (
        segment_id INTEGER PRIMARY KEY,
        segment_name VARCHAR(50)
);
 
   CREATE TABLE product_price (
        product_price_id INTEGER PRIMARY KEY,
        unit_price money,
        segment_id INTEGER REFERENCES product_segment(segment_id)
);

    CREATE TABLE sales_method (
        method_id INTEGER PRIMARY KEY,
        method_name VARCHAR(50)
);
    
    CREATE TABLE invoice_line (
        invoice_id INTEGER PRIMARY KEY,
        invoice_date DATE,
        units_sold INTEGER,
        total_sales money,
        operating_profit money,
        operating_margin NUMERIC(4,2)
);
    
    CREATE TABLE invoice (
        invoice_id INTEGER REFERENCES invoice_line(invoice_id),
        segment_id INTEGER REFERENCES product_segment(segment_id),
        method_id INTEGER REFERENCES sales_method(method_id),
        retailer_id INTEGER REFERENCES retailer(retailer_id)
);

"""
    
cur.execute(createCmd)
conn.commit()

### Create 'location' table

In [8]:
location_df=df[['region','state','city']]

location_df=location_df.drop_duplicates()

In [9]:
# Add incrementing integers
location_df.insert(0, 'location_id', range(1, 1 + len(location_df)))
location_df.head()

     location_id     region       state           city
0              1  Northeast    New York       New York
72             2      South       Texas        Houston
144            3       West  California  San Francisco
216            4       West  California    Los Angeles
288            5    Midwest    Illinois        Chicago

In [10]:
# push the location data to the database 'location'

location_df.drop_duplicates().to_sql(name='location', con=engine, if_exists='append', index=False)

54

In [11]:
 # Join the original dataframe with the location_df 
df = pd.merge(df,location_df,on=['region','state','city'])

location_id_col = df.pop('location_id')
df.insert(2, 'location_id', location_id_col)
df.head()

,retailer,invoice_date,location_id,region,state,city,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,sales_method
0,Foot Locker,1/1/20,1,Northeast,New York,New York,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,Foot Locker,1/2/20,1,Northeast,New York,New York,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,Foot Locker,1/3/20,1,Northeast,New York,New York,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,Foot Locker,1/4/20,1,Northeast,New York,New York,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,Foot Locker,1/5/20,1,Northeast,New York,New York,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

### Create Retailer table

In [12]:
# Extract 'retailer' column
retailer_name = df['retailer']

retailer_df = pd.DataFrame(df.retailer.unique(),columns=['retailer_name'])

In [13]:
# Add incrementing integers for retailer_id
retailer_df.insert(0, 'retailer_id', range(1, 1 + len(retailer_df)))
retailer_df

   retailer_id  retailer_name
0            1    Foot Locker
1            2        Walmart
2            3  Sports Direct
3            4      West Gear
4            5         Kohl's
5            6         Amazon

In [14]:
# Map retailer_id with origiinal dataset
retailer_id_list = [retailer_df.retailer_id[retailer_df.retailer_name == i].values[0] for i in df.retailer]

In [15]:
# Add retailer_id to the main dataframe
df.insert(0, 'retailer_id', retailer_id_list)
df.head()

,retailer_id,retailer,invoice_date,location_id,region,state,city,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,sales_method
0,1,Foot Locker,1/1/20,1,Northeast,New York,New York,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,1,Foot Locker,1/2/20,1,Northeast,New York,New York,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,1,Foot Locker,1/3/20,1,Northeast,New York,New York,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,1,Foot Locker,1/4/20,1,Northeast,New York,New York,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,1,Foot Locker,1/5/20,1,Northeast,New York,New York,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

#### Relate 'location_id' to 'retailer' table

In [16]:
retailer_df = df[['retailer','location_id']]
retailer_df = retailer_df.drop_duplicates()

In [17]:
# Add incrementing integers for retailer_id
retailer_df.insert(0, 'retailer_id', range(1, 1 + len(retailer_df)))
retailer_df

      retailer_id       retailer  location_id
0               1    Foot Locker            1
46              2        Walmart            1
68              3  Sports Direct            1
216             4  Sports Direct            2
234             5        Walmart            2
...           ...            ...          ...
9050          106         Amazon           52
9216          107         Amazon           53
9266          108      West Gear           53
9432          109         Amazon           54
9477          110    Foot Locker           54

[110 rows x 3 columns]

In [18]:
# push the reatiler data to the database 'retailer'

retailer_df.drop_duplicates().to_sql(name='retailer', con=engine, if_exists='append', index=False)

110

In [19]:
# group by 'retailer_id', total_sales sort

sales_by_retailer = df.groupby('retailer_id')['total_sales'].sum()

# sort by total_sales in descending order
sales_by_retailer = sales_by_retailer.sort_values(ascending=False)

# print the result
print(sales_by_retailer)

retailer_id
1    $600,000 $500,000 $400,000 $382,500 $540,000 $...
2    $540,000 $698,750 $720,000 $550,000 $462,500 $...
4    $310,000 $387,500 $387,500 $312,500 $7,733 $9,...
5    $245,000 $315,000 $315,000 $247,500 $6,496 $8,...
3    $225,000 $315,000 $245,000 $245,000 $5,616 $7,...
6    $180,000 $100,000 $75,000 $35,000 $4,446 $2,85...
Name: total_sales, dtype: object

### Create 'product_segment' table

In [20]:
# Extract 'segment' column
segment = df['segment']

segment_df = pd.DataFrame(df['segment'].unique(),columns=['segment_name'])

In [21]:
# Add incrementing integers for segment_id
segment_df.insert(0, 'segment_id', range(1, 1 + len(segment_df)))
segment_df

   segment_id               segment_name
0           1      Men's Street Footwear
1           2    Men's Athletic Footwear
2           3    Women's Street Footwear
3           4  Women's Athletic Footwear
4           5              Men's Apparel
5           6            Women's Apparel

In [22]:
# push the segment data to the database 'segment'
segment_df.drop_duplicates().to_sql(name='product_segment', con=engine, if_exists='append', index=False)

6

In [23]:
# Map segment_id
segment_id_list = [segment_df.segment_id[segment_df.segment_name == i].values[0] for i in df['segment']]

In [24]:
# Add segment_id to the main dataframe
df.insert(7, 'segment_id', segment_id_list)
df.head()

,retailer_id,retailer,invoice_date,location_id,region,state,city,segment_id,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,sales_method
0,1,Foot Locker,1/1/20,1,Northeast,New York,New York,1,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,1,Foot Locker,1/2/20,1,Northeast,New York,New York,2,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,1,Foot Locker,1/3/20,1,Northeast,New York,New York,3,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,1,Foot Locker,1/4/20,1,Northeast,New York,New York,4,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,1,Foot Locker,1/5/20,1,Northeast,New York,New York,5,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

In [25]:
df['operating_profit'] = pd.to_numeric(df['operating_profit'].str.replace(r'[^\d.]', ''))

/var/folders/7j/l7w_0dqj7c7_6b8sq51_88140000gn/T/ipykernel_54247/505771455.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['operating_profit'] = pd.to_numeric(df['operating_profit'].str.replace(r'[^\d.]', ''))

### Create 'sales_method' table

In [26]:
# Extract 'retailer' column
method = df['sales_method']

sales_method_df = pd.DataFrame(df['sales_method'].unique(),columns=['method_name'])

In [27]:
# Add incrementing integers for sales_method_id
sales_method_df.insert(0, 'method_id', range(1, 1 + len(sales_method_df)))
sales_method_df

   method_id method_name
0          1    In-store
1          2      Outlet
2          3      Online

In [28]:
# push the sales method data to the database 'sales_method'

sales_method_df.drop_duplicates().to_sql(name='sales_method', con=engine, if_exists='append', index=False)

3

In [29]:
# Map method_id
sales_method_list = [sales_method_df.method_id[sales_method_df.method_name == i].values[0] for i in df['sales_method']]

In [30]:
# Add method_id to the main dataframe
df.insert(14, 'method_id', sales_method_list)
df.head()

,retailer_id,retailer,invoice_date,location_id,region,state,city,segment_id,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,method_id,sales_method
0,1,Foot Locker,1/1/20,1,Northeast,New York,New York,1,Men's Street Footwear,$50.00,"1,200","$600,000",300000,50%,1,In-store
1,1,Foot Locker,1/2/20,1,Northeast,New York,New York,2,Men's Athletic Footwear,$50.00,"1,000","$500,000",150000,30%,1,In-store
2,1,Foot Locker,1/3/20,1,Northeast,New York,New York,3,Women's Street Footwear,$40.00,"1,000","$400,000",140000,35%,1,In-store
3,1,Foot Locker,1/4/20,1,Northeast,New York,New York,4,Women's Athletic Footwear,$45.00,850,"$382,500",133875,35%,1,In-store
4,1,Foot Locker,1/5/20,1,Northeast,New York,New York,5,Men's Apparel,$60.00,900,"$540,000",162000,30%,1,In-store

### Create 'product_price' table

In [31]:
price_df = df[['unit_price']]
price_df = pd.DataFrame(df['unit_price'].unique(),columns=['unit_price'])

##Add incrementing integers
price_df.insert(0, 'product_price_id', range(1, 1 + len(price_df)))
price_df

In [32]:
product_price_df = df[['unit_price','segment_id']]
product_price_df = product_price_df.drop_duplicates()

In [33]:
# Add incrementing integers
product_price_df.insert(0, 'product_price_id', range(1, 1 + len(product_price_df)))
product_price_df

      product_price_id unit_price  segment_id
0                    1    $50.00            1
1                    2    $50.00            2
2                    3    $40.00            3
3                    4    $45.00            4
4                    5    $60.00            5
...                ...        ...         ...
6883               450    $18.00            5
6889               451    $21.00            5
6892               452    $11.00            2
6911               453    $12.00            3
7562               454    $15.00            6

[454 rows x 3 columns]

In [34]:
# push the product price data to the database 'product_price'

product_price_df.drop_duplicates().to_sql(name='product_price', con=engine, if_exists='append', index=False)

454

### Create 'invoice' table

In [35]:
invoice_line_df = df[['invoice_date','units_sold','total_sales','operating_profit','operating_margin']]
invoice_line_df.drop_duplicates()

     invoice_date units_sold total_sales  operating_profit operating_margin
0          1/1/20      1,200   $600,000             300000              50%
1          1/2/20      1,000   $500,000             150000              30%
2          1/3/20      1,000   $400,000             140000              35%
3          1/4/20        850   $382,500             133875              35%
4          1/5/20        900   $540,000             162000              30%
...           ...        ...         ...               ...              ...
9643      1/24/21         64     $3,200                896              28%
9644      1/24/21        105     $4,305               1378              32%
9645      2/22/21        184     $7,544               2791              37%
9646      2/22/21         70     $2,940               1235              42%
9647      2/22/21         83     $2,407                650              27%

[9534 rows x 5 columns]

In [36]:
# Add incrementing integers
invoice_line_df.insert(0, 'invoice_id', range(1, 1 + len(invoice_line_df)))
invoice_line_df

,invoice_id,invoice_date,units_sold,total_sales,operating_profit,operating_margin
0,1,1/1/20,"1,200","$600,000",300000,50%
1,2,1/2/20,"1,000","$500,000",150000,30%
2,3,1/3/20,"1,000","$400,000",140000,35%
3,4,1/4/20,850,"$382,500",133875,35%
4,5,1/5/20,900,"$540,000",162000,30%
...,...,...,...,...,...,...
9643,9644,1/24/21,64,"$3,200",896,28%
9644,9645,1/24/21,105,"$4,305",1378,32%
9645,9646,2/22/21,184,"$7,544",2791,37%
9646,9647,2/22/21,70,"$2,940",1235,42%
9647,9648,2/22/21,83,"$2,407",650,27%

In [37]:
# Convert the column to numeric type
invoice_line_df['units_sold'] = pd.to_numeric(invoice_line_df['units_sold'], errors='coerce')

# Convert the column to integer type
invoice_line_df['units_sold'] = invoice_line_df['units_sold'].astype('Int64')

/var/folders/7j/l7w_0dqj7c7_6b8sq51_88140000gn/T/ipykernel_54247/3346904433.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  invoice_line_df['units_sold'] = pd.to_numeric(invoice_line_df['units_sold'], errors='coerce')
/var/folders/7j/l7w_0dqj7c7_6b8sq51_88140000gn/T/ipykernel_54247/3346904433.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  invoice_line_df['units_sold'] = invoice_line_df['units_sold'].astype('Int64')

In [38]:
# Remove the '%' character from the string
invoice_line_df['operating_margin'] = invoice_line_df['operating_margin'].str.replace('%', '')

# Convert the column to numeric
invoice_line_df['operating_margin'] = pd.to_numeric(invoice_line_df['operating_margin'], errors='coerce')

/var/folders/7j/l7w_0dqj7c7_6b8sq51_88140000gn/T/ipykernel_54247/228801437.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  invoice_line_df['operating_margin'] = invoice_line_df['operating_margin'].str.replace('%', '')
/var/folders/7j/l7w_0dqj7c7_6b8sq51_88140000gn/T/ipykernel_54247/228801437.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  invoice_line_df['operating_margin'] = pd.to_numeric(invoice_line_df['operating_margin'], errors='coerce')

In [39]:
# push the invoice line data to the database 'invoice_line'

invoice_line_df.drop_duplicates().to_sql(name='invoice_line', con=engine, if_exists='append', index=False)

648

In [40]:
# Map invoice_id
invoice_id_list = [invoice_line_df.invoice_id[invoice_line_df.invoice_date == i].values[0] 
              for i in df['invoice_date']]

In [41]:
# Add invoice_id to the main dataframe
df.insert(2, 'invoice_id', invoice_id_list)
df.head()

,retailer_id,retailer,invoice_id,invoice_date,location_id,region,state,city,segment_id,segment,unit_price,units_sold,total_sales,operating_profit,operating_margin,method_id,sales_method
0,1,Foot Locker,1,1/1/20,1,Northeast,New York,New York,1,Men's Street Footwear,$50.00,"1,200","$600,000",300000,50%,1,In-store
1,1,Foot Locker,2,1/2/20,1,Northeast,New York,New York,2,Men's Athletic Footwear,$50.00,"1,000","$500,000",150000,30%,1,In-store
2,1,Foot Locker,3,1/3/20,1,Northeast,New York,New York,3,Women's Street Footwear,$40.00,"1,000","$400,000",140000,35%,1,In-store
3,1,Foot Locker,4,1/4/20,1,Northeast,New York,New York,4,Women's Athletic Footwear,$45.00,850,"$382,500",133875,35%,1,In-store
4,1,Foot Locker,5,1/5/20,1,Northeast,New York,New York,5,Men's Apparel,$60.00,900,"$540,000",162000,30%,1,In-store

In [42]:
invoice_df = df[['invoice_id','retailer_id','segment_id','method_id']]
invoice_df

      invoice_id  retailer_id  segment_id  method_id
0              1            1           1          1
1              2            1           2          1
2              3            1           3          1
3              4            1           4          1
4              5            1           5          1
...          ...          ...         ...        ...
9643         477            1           5          2
9644         477            1           6          2
9645        2285            1           1          2
9646        2285            1           2          2
9647        2285            1           3          2

[9648 rows x 4 columns]

In [43]:
# push the invoice data to the database 'invoice'

invoice_df.drop_duplicates().to_sql(name='invoice', con=engine, if_exists='append', index=False)

398

# 1. What items should Adidas sell more in each season?

In [55]:
query = """SELECT 
    EXTRACT(YEAR FROM invoice_date) AS year,
    CASE 
        WHEN EXTRACT(MONTH FROM invoice_date) IN (3, 4, 5) THEN 'Spring'
        WHEN EXTRACT(MONTH FROM invoice_date) IN (6, 7, 8) THEN 'Summer'
        WHEN EXTRACT(MONTH FROM invoice_date) IN (9, 10, 11) THEN 'Fall'
        ELSE 'Winter'
    END AS season,
    product_segment.segment_id,
	product_segment.segment_name,
    AVG(total_sales::numeric(10,2)) AS average_sales_revenue
FROM 
    product_segment 
    JOIN invoice ON product_segment.segment_id = invoice.segment_id 
    JOIN invoice_line ON invoice.invoice_id = invoice_line.invoice_id 
WHERE 
    EXTRACT(YEAR FROM invoice_date) IN (2020, 2021)
GROUP BY 
    year, season,product_segment.segment_id
ORDER BY average_sales_revenue DESC;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2],row[3],row[4])
    row = cur.fetchone()

2020 Spring 1 Men's Street Footwear 541862.745098039216
2020 Spring 2 Men's Athletic Footwear 505637.254901960784
2020 Spring 6 Women's Apparel 481202.830188679245
2020 Winter 1 Men's Street Footwear 440489.795918367347
2020 Fall 6 Women's Apparel 424187.500000000000
2020 Spring 3 Women's Street Footwear 414377.551020408163
2020 Winter 6 Women's Apparel 402967.391304347826
2020 Spring 5 Men's Apparel 394509.803921568627
2020 Spring 4 Women's Athletic Footwear 388459.183673469388
2020 Summer 6 Women's Apparel 386079.545454545455
2020 Fall 1 Men's Street Footwear 383375.000000000000
2020 Summer 2 Men's Athletic Footwear 373181.818181818182
2021 Winter 3 Women's Street Footwear 358095.703125000000
2021 Winter 2 Men's Athletic Footwear 355323.929961089494
2020 Winter 2 Men's Athletic Footwear 354836.956521739130
2021 Winter 6 Women's Apparel 354261.178861788618
2021 Winter 1 Men's Street Footwear 353517.068273092369
2021 Winter 4 Women's Athletic Footwear 350561.264822134387
2021 Winter 5 Men's Apparel 350378.906250000000
2020 Fall 3 Women's Street Footwear 346704.545454545455
2020 Summer 1 Men's Street Footwear 342215.909090909091
2020 Winter 5 Men's Apparel 338940.217391304348
2020 Winter 4 Women's Athletic Footwear 328602.941176470588
2021 Spring 6 Women's Apparel 327998.120300751880
2020 Fall 2 Men's Athletic Footwear 324312.500000000000
2021 Spring 1 Men's Street Footwear 322490.494296577947
2020 Fall 5 Men's Apparel 322250.000000000000
2021 Spring 2 Men's Athletic Footwear 321406.250000000000
2020 Winter 3 Women's Street Footwear 320845.744680851064
2021 Spring 4 Women's Athletic Footwear 319202.425373134328
2021 Spring 3 Women's Street Footwear 316591.760299625468
2021 Spring 5 Men's Apparel 316189.814814814815
2020 Fall 4 Women's Athletic Footwear 310250.000000000000
2020 Summer 3 Women's Street Footwear 307559.523809523810
2020 Summer 4 Women's Athletic Footwear 266666.666666666667
2020 Summer 5 Men's Apparel 251785.714285714286
2021 Fall 6 Women's Apparel 251420.664206642066
2021 Fall 1 Men's Street Footwear 250392.723880597015
2021 Fall 4 Women's Athletic Footwear 242354.868913857678
2021 Fall 5 Men's Apparel 240966.417910447761
2021 Fall 3 Women's Street Footwear 240410.447761194030
2021 Fall 2 Men's Athletic Footwear 239050.572519083969
2021 Summer 5 Men's Apparel 146353.053435114504
2021 Summer 1 Men's Street Footwear 146266.853932584270
2021 Summer 6 Women's Apparel 144673.872180451128
2021 Summer 4 Women's Athletic Footwear 138888.030888030888
2021 Summer 2 Men's Athletic Footwear 138053.703703703704
2021 Summer 3 Women's Street Footwear 135703.598484848485

# 2. Is there any significant difference in sales performance in different geographical locations?

In [45]:
query = """SELECT l.region, AVG(il.total_sales::numeric) as average_sales
FROM location l
JOIN retailer r ON l.location_id = r.location_id
JOIN invoice i ON r.retailer_id = i.retailer_id
JOIN invoice_line il ON i.invoice_id = il.invoice_id
GROUP BY l.region;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1])
    row = cur.fetchone()

South 292643.183766790512
Northeast 270003.718902282637

# 3. What is the top-selling product in each retailer?

In [46]:
query = """WITH product_sales AS (
  SELECT r.retailer_id, r.retailer, ps.segment_id, ps.segment_name, SUM(il.total_sales::numeric) as total_sales
  FROM invoice_line il
  JOIN invoice i ON il.invoice_id = i.invoice_id
  JOIN retailer r ON i.retailer_id = r.retailer_id
  JOIN product_segment ps ON i.segment_id = ps.segment_id
  GROUP BY r.retailer_id, r.retailer, ps.segment_id, ps.segment_name
),
ranked_product_sales AS (
  SELECT retailer_id, retailer, segment_id, segment_name, total_sales,
    RANK() OVER (PARTITION BY retailer_id ORDER BY total_sales DESC) as sales_rank
  FROM product_sales
)
SELECT retailer_id, retailer, segment_id, segment_name, total_sales
FROM ranked_product_sales
WHERE sales_rank = 1;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2],row[3],row[4])
    row = cur.fetchone()

1 Foot Locker 1 Men's Street Footwear 96891250.00
2 Walmart 6 Women's Apparel 26810000.00
3 Sports Direct 6 Women's Apparel 67128500.00
4 Sports Direct 2 Men's Athletic Footwear 105190750.00
5 Walmart 3 Women's Street Footwear 41138750.00
6 West Gear 6 Women's Apparel 32705000.00

# 4. Which retailer store has the highest operational efficiency?

In [47]:
query = """WITH retailer_margin AS (
  SELECT r.retailer_id, r.retailer, AVG(il.operating_margin) as avg_operating_margin
  FROM invoice_line il
  JOIN invoice i ON il.invoice_id = i.invoice_id
  JOIN retailer r ON i.retailer_id = r.retailer_id
  GROUP BY r.retailer_id, r.retailer
),
ranked_retailer_margin AS (
  SELECT retailer_id, retailer, avg_operating_margin,
    RANK() OVER (ORDER BY avg_operating_margin DESC) as efficiency_rank
  FROM retailer_margin
)
SELECT retailer_id, retailer, avg_operating_margin, efficiency_rank
FROM ranked_retailer_margin;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2],row[3])
    row = cur.fetchone()

2 Walmart 37.9642058165548098 1
3 Sports Direct 37.6104972375690608 2
1 Foot Locker 37.4900199600798403 3
6 West Gear 37.0065789473684211 4
4 Sports Direct 36.2205128205128205 5
5 Walmart 35.2217997465145754 6

# 5.which region is the most active market of Adidas?

In [48]:
query = """SELECT l.region, COUNT(r.retailer_id) as retailer_count
FROM location l
JOIN retailer r ON l.location_id = r.location_id
GROUP BY l.region
ORDER BY retailer_count DESC;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1])
    row = cur.fetchone()

Northeast 28
Midwest 24
West 24
South 18
Southeast 16

# 6. which retailer store is the most profitable in each region?

In [49]:
query = """WITH retailer_profit AS (
  SELECT l.region, r.retailer_id, r.retailer, SUM(il.operating_profit::numeric) as total_profit
  FROM location l
  JOIN retailer r ON l.location_id = r.location_id
  JOIN invoice i ON r.retailer_id = i.retailer_id
  JOIN invoice_line il ON i.invoice_id = il.invoice_id
  GROUP BY l.region, r.retailer_id, r.retailer
),
ranked_retailer_profit AS (
  SELECT region, retailer_id, retailer, total_profit,
    RANK() OVER (PARTITION BY region ORDER BY total_profit DESC) as profit_rank
  FROM retailer_profit
)
SELECT region, retailer_id, retailer, total_profit
FROM ranked_retailer_profit
WHERE profit_rank = 1;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2],row[3])
    row = cur.fetchone()

Northeast 1 Foot Locker 189339417.00
South 4 Sports Direct 204786830.00

# 7. which product segment has the best sales performance?

In [50]:
query = """SELECT
    ps.segment_id,
    ps.segment_name,
    SUM(il.total_sales::numeric) as product_sales
FROM
    product_segment ps
JOIN
    invoice i ON ps.segment_id = i.segment_id
JOIN
    invoice_line il ON i.invoice_id = il.invoice_id
GROUP BY
    ps.segment_id, ps.segment_name
HAVING
    SUM(il.total_sales::numeric) > 0
ORDER BY
    product_sales DESC;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2])
    row = cur.fetchone()

6 Women's Apparel 359009250.00
1 Men's Street Footwear 358610750.00
2 Men's Athletic Footwear 347577750.00
3 Women's Street Footwear 340015000.00
5 Men's Apparel 337168000.00
4 Women's Athletic Footwear 334322250.00

# 8. which sales method performs best?

In [51]:
query = """SELECT
    sm.method_id,
    sm.method_name,
    SUM(il.total_sales::numeric) as method_sales
FROM
    sales_method sm
JOIN
    invoice i ON sm.method_id = i.method_id
JOIN
    invoice_line il ON i.invoice_id = il.invoice_id
GROUP BY
    sm.method_id, sm.method_name
ORDER BY
    method_sales DESC;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2])
    row = cur.fetchone()

3 Online 983093750.00
2 Outlet 622552750.00
1 In-store 471056500.00

# 9. which city has the best sales performance?

In [52]:
query = """SELECT location.state, location.city, SUM(invoice_line.total_sales) as total_sales
FROM invoice
INNER JOIN invoice_line ON invoice.invoice_id = invoice_line.invoice_id
INNER JOIN retailer ON invoice.retailer_id = retailer.retailer_id
INNER JOIN location ON retailer.location_id = location.location_id
GROUP BY location.state, location.city
ORDER BY location.state, total_sales DESC;
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2])
    row = cur.fetchone()

New York New York $1,052,744,500.00
Texas Houston $1,023,958,500.00

# 10. What is the profit difference between female and male products?

In [53]:
query = """WITH gender_profit AS (
  SELECT
    CASE
      WHEN ps.segment_name LIKE 'Women%' THEN 'Women'
      WHEN ps.segment_name LIKE 'Men%' THEN 'Men'
      ELSE 'Other'
    END AS gender,
    SUM(il.operating_profit::numeric) as total_profit
  FROM product_segment ps
  JOIN invoice i ON ps.segment_id = i.segment_id
  JOIN invoice_line il ON i.invoice_id = il.invoice_id
  GROUP BY gender
)
SELECT
  women.total_profit AS women_profit,
  men.total_profit AS men_profit,
  ABS(women.total_profit - men.total_profit) AS profit_difference
FROM gender_profit women
JOIN gender_profit men ON 1=1
WHERE women.gender = 'Women' AND men.gender = 'Men';
"""
cur.execute(query)
row = cur.fetchone()
while row is not None:
    print(row[0],row[1],row[2])
    row = cur.fetchone()

366046758.00 375179288.00 9132530.00